cells = {
    1: {
        'город': "Первоуральск",
        "адрес": "ул. Трубников.",
        "лидер": "Даниил Мостицкий",
        "описание": "Строго старше 18ти лет. Ячейка состоит из женатых молодых пар с маленькими детьми, поэтому и целевая аудитория соответствующая.",
        "телефон": "+7 996 172 3709",
        "тг_ссылка": "@mosdandi",
        "возраст": "Больше 18",
        "семья": "да",
        'картинка': 'AgACAgIAAxkBAAMKZjP-Y5Q9r5UBHkVkuZQgRUjolocAAr3gMRvuDaBJLIOAlNHni_EBAAMCAAN5AAM0BA',
        "пол": 'Любой'
    },
    2: {
        'город': "Первоуральск",
        "адрес": "ул. Береговой.",
        "лидер": "Алексей Черноскутов",
        "описание": "Ячейка от 18ти лет для ребят которые не женаты, но находятся в отношениях, но также подойдет и для тех, кто не в отношениях.",
        "телефон": "+7 982 631 1086",
        "тг_ссылка": "@alexchernoskutov",
        "возраст": "Больше 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMMZjP-aOeJvTQAAaUVUPdd8NJbQ-h9AALF4DEb7g2gST1uCafWS_u3AQADAgADeQADNAQ',
        "пол": 'Любой'
    },
    3: {
        'город': "Екатеринбург",
        "адрес": "Железнодорожный район.",
        "лидер": "Наталья Попова",
        "описание": "Ячейка для студентов и работающих ребят из Екатеринбурга. Проводится в ЕКБ для всех желающих.",
        "телефон": "+7 982 720 3623",
        "тг_ссылка": "@singyoutosleeppp",
        "возраст": "Больше 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMCZjP-S819HUqb4udkjePXren6pwYAAtbgMRvuDaBJRb5TcphA1F8BAAMCAAN5AAM0BA',
        "пол": 'Любой'
    },
    4: {
        'город': "Первоуральск",
        "адрес": "ул. Маяковского",
        "лидер": "Александр Сапегин",
        "описание": "Молодёжно-подростковая ячейка для парней от 13 до 18 лет (в планах делить на более точные возраста). Подойдет в том случае, если ты брат-братан-братишка.",
        "телефон": "+7 992 333 1234",
        "тг_ссылка": "@SashSape",
        "возраст": "13 - 18",
        "семья": "нет",
        'картинка': "AgACAgIAAxkBAAMQZjP-clbGn8WT9vMtt04CR-nFPiIAAtvgMRvuDaBJo6iHSj_xJ_ABAAMCAAN5AAM0BA",
        'пол': "Мальчик"
    },
    5: {
        'город': "Первоуральск",
        "адрес": "ул. Трубников.",
        "лидер": "Ольга Мостицкая",
        "описание": "Молодёжно-подростковая ячейка для девчонок от 13 до 18 лет (в планах делить на более точные возраста). Подойдет в том случае, если ты сестра-сестричка-систр.",
        "телефон": "+7 967 854 8930",
        "тг_ссылка": "@mostickayaon",
        "возраст": "13 - 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMEZjP-UusSjAcUOiG_8xD93GPb3KwAAtfgMRvuDaBJi4hsRPnnvtwBAAMCAAN5AAM0BA',
        'пол': "Девочка"
    },
    6: {
        'город': "Новоуткинск",
        "адрес": "Центральный район",
        "лидер": "Алексей Саматов",
        "описание": "Ячейка для всех возрастов и гендеров (в планах делить на более точные возраста и гендеры) проходящая в поселке Новоуткинск. Если ты живешь, учишься или работаешь в этой местности, то милости просим.",
        "телефон": "+7 902 272 6461",
        "тг_ссылка": "samalex306",
        "возраст": "Больше 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMOZjP-bOfUY1ZG-hwM7ldHg9OaetcAAsfgMRvuDaBJitHwJa_dUS4BAAMCAAN5AAM0BA',
        "пол": 'Любой'
    },
    7: {
        'город': "Первоуральск",
        "адрес": "ул. Ватутина",
        "лидер": "Иван Ватолин",
        "описание": "Ячейка от 18ти лет для ребят которые не женаты, но находятся в отношениях, но также подойдет и для тех, кто не в отношениях.",
        "телефон": "+7 922 138 5012",
        "тг_ссылка": "@Vatolin_Ivan",
        "возраст": "Больше 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMIZjP-Xk_pz6qvI5HCCTDpDwdq5GMAAsXgMRvuDaBJPW4Jp9ZL-7cBAAMCAAN5AAM0BA',
        "пол": 'Любой'
    },
    8: {
        'город': "Динас",
        "адрес": "ул. Огнеупорников",
        "лидер": "Александр Зинатов",
        "описание": "Молодёжно-подростковая ячейка для парней от 13 до 18 лет. Подойдет в том случае, если ты брат-братан-братишка.",
        "телефон": "+7 912 050 5541",
        "тг_ссылка": "@tipochotonapisal",
        "возраст": "13 - 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMGZjP-WFvYrXS1RoOnmfm-pJEafkUAAtXgMRvuDaBJGDpwtglTw0MBAAMCAAN5AAM0BA',
        "пол": 'Мальчик'
    },
    9: {
        'город': "Динас",
        "адрес": "ул. Огнеупорников",
        "лидер": "Александр Зинатов",
        "описание": "Молодёжно-подростковая ячейка на Динасе от 13 до 18 лет.",
        "телефон": "+7 912 050 5541",
        "тг_ссылка": "@tipochotonapisal",
        "возраст": "13 - 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMGZjP-WFvYrXS1RoOnmfm-pJEafkUAAtXgMRvuDaBJGDpwtglTw0MBAAMCAAN5AAM0BA',
        "пол": 'Девочек'
    },
    10: {
        'город': "Динас",
        "адрес": "ул. Огнеупорников",
        "лидер": "Александр Зинатов",
        "описание": "Молодёжно-подростковая ячейка на Динасе!. Подойдет в том случае, если ты брат-братан-братишка.",
        "телефон": "+7 912 050 5541",
        "тг_ссылка": "@tipochotonapisal",
        "возраст": "Больше 18",
        "семья": "нет",
        'картинка': 'AgACAgIAAxkBAAMGZjP-WFvYrXS1RoOnmfm-pJEafkUAAtXgMRvuDaBJGDpwtglTw0MBAAMCAAN5AAM0BA',
        "пол": 'Любой'
    },
}

contact_list = {

    '13-16 лет': {
        'фио': 'Ефимов Вениамин',
        "номер": "+79530041954",
        "адрес": "Кузнечная 84",
        "ссылка": 'https://t.me/ITiRex'
    }
    ,
    '17-23 лет': {
        'фио': 'Мостицкий Даниил',
        "номер": "+795012411254",
        "адрес": "Мира 71",
        "ссылка": 'https://t.me/mosdandi'
    },
    '24-29 лет': {
        'фио': 'Мостицкий Даниил',
        "номер": "+79532044731",
        "адрес": "Луначарского 14",
        "ссылка": 'https://t.me/mosdandi'
    },
    '30-45 лет': {
        'фио': 'Ефимов Вениамин',
        "номер": "+79530041954",
        "адрес": "Кузнечная 84",
        "ссылка": 'https://t.me/ITiRex'
    },
}

dibrary_dict = {
    1: {
        'название': 'История о браке',
        "тема": 'Личная жизнь',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANpZjQC6DdijJZxVlisoekfZkj-UE8AAtcBMhtLJqFJfxZ5cvfz9YUBAAMCAAN5AAM0BA',
        'автор': 'Джон и Лиза Бивер'
    },
    2: {
        'название': 'Жизнь Иисуса Христа',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANnZjQC5qxJ3jkxcOx87tWVZluPddYAAtYBMhtLJqFJmZwM-rEqqi0BAAMCAAN5AAM0BA',
        'автор': 'Mission Possible Foundation'
    },
    3: {
        'название': 'Управление финансами',
        "тема": 'Финансы',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANlZjQC5BVG0FA4q-IPHoz9mjIhD80AAtUBMhtLJqFJv-I5rW0uHSgBAAMCAAN5AAM0BA',
        'автор': 'Mission Possible Foundation'
    },
    5: {
        'название': 'Побеждая греховные желания',
        "тема": 'Тем, кто в сражении',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANhZjQC38jOOFM5B3YixeivMr3eoEcAAtMBMhtLJqFJcBvbNAUM-qsBAAMCAAN5AAM0BA',
        'автор': 'Лестер Сапралл'
    },
    6: {
        'название': 'Как быть ведомым Духом Божиим',
        "тема": 'Дух Святой',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANfZjQC3V-RaRyk7HdAg43D67AKEXsAAtIBMhtLJqFJZRBkVB9ia6cBAAMCAAN5AAM0BA',
        'автор': 'Кенет Б. Хейгин'
    },
    7: {
        'название': 'Детский Библейский клуб',
        "тема": 'Лидерство',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANdZjQC2tVwIH4GsOlViiXSuaU7mbQAAtEBMhtLJqFJE0oTQJATM5EBAAMCAAN5AAM0BA',
        'автор': 'ission Possible Foundation'
    },
    8: {
        'название': 'Крик в ночи',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANbZjQC2GlvzhAZr5eFqBQxA-olCMAAAtABMhtLJqFJ1F7JR8VSEf0BAAMCAAN5AAM0BA',
        'автор': 'Дэвид Йонги Чо'
    },
    9: {
        'название': 'Сила Веры',
        "тема": 'Тем, кто в сражении',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANZZjQC1Zuppn_ccr_F6yY9lkS8l18AAs8BMhtLJqFJ1Q7cvPMGA_UBAAMCAAN5AAM0BA',
        'автор': 'Кеннет Коупленд'
    },
    10: {
        'название': 'Общение - ключ к вашему браку',
        "тема": 'Личная жизнь',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANXZjQC0k_LVmMX7oCRyy-iQZo3juYAAs4BMhtLJqFJYPaohpQ4bEkBAAMCAAN5AAM0BA',
        'автор': 'Норман Райт'
    },
    11: {
        'название': 'Могущественный дуэт',
        "тема": 'Молитва',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANVZjQC0N--C-OC1oJoWGmTGkabFgsAAs0BMhtLJqFJPO6IAo9MIsMBAAMCAAN5AAM0BA',
        'автор': 'Рик Реннер'
    },
    12: {
        'название': 'Благословение или проклятие',
        "тема": 'Тем, кто в сражении',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANTZjQCziNRFGpHxxVq1G3X99yYxpMAAswBMhtLJqFJu2J8pFi_tqkBAAMCAAN5AAM0BA',
        'автор': 'Дерек Принс'
    },
    13: {
        'название': 'Основы духовного роста',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANRZjQCzKKZ89Fl5Egp9vng-hIYw2AAAssBMhtLJqFJvP3ueOwkgbMBAAMCAAN5AAM0BA',
        'автор': 'Кеннет Е. Хейгин'
    },
    14: {
        'название': 'Деяние апостолов',
        "тема": 'Дух Святой',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANPZjQCyv50kC09mUhhHwlOpknB7rQAAsoBMhtLJqFJE-CnENiB6wQBAAMCAAN5AAM0BA',
        'автор': 'Стэнли Хортон'
    },
    15: {
        'название': 'Дух, душа, тело',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANNZjQCx4_Gv3mtoCnhaG_GuIU1pI8AAskBMhtLJqFJbt3iXL2-Vw0BAAMCAAN5AAM0BA',
        'автор': 'Лестер Самралл'
    },
    16: {
        'название': 'Духовные дары',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANLZjQCxR48qUpkT6Xcfwtr0Qu5LR0AAsgBMhtLJqFJ9Yzbspk4PfUBAAMCAAN5AAM0BA',
        'автор': 'Райнгольд Улонска'
    },
    17: {
        'название': 'Победоносная Церковь',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANJZjQCw2RC1C5g9bSHj1KvQQxM0_UAAscBMhtLJqFJg6kemMkfOVMBAAMCAAN5AAM0BA',
        'автор': 'Кеннет Е. Хейгин'
    },
    18: {
        'название': 'Власть в молитве',
        "тема": 'Молитва',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANHZjQCwMbNPuVOi0r5tAg4eM2l178AAsYBMhtLJqFJ134RrcZ1OpoBAAMCAAN5AAM0BA',
        'автор': 'Датч Шитс'
    },
    19: {
        'название': 'Глубины Божии',
        "тема": 'Молитва',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANFZjQCvpiypUJ0Fnbnk2K0KmyUInsAAsUBMhtLJqFJr0A7ey6LaSsBAAMCAAN5AAM0BA',
        'автор': 'Mission Possible Foundation'
    },
    20: {
        'название': 'Возможности Святого Духа',
        "тема": 'Дух Святой',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANDZjQCu5w2AAG5IWZpgOBpnjBCVn8BAALEATIbSyahSayIuiNiFFQQAQADAgADeQADNAQ',
        'автор': 'Mission Possible Foundation'
    },
    21: {
        'название': 'Иследование учения о Святом Духе',
        "тема": 'Дух Святой',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAANBZjQCuS87wVsp0yQ7HkgIG0aIk4wAAsMBMhtLJqFJDZQQ7v6SHS4BAAMCAAN5AAM0BA',
        'автор': 'Вильям Э. Бидервольф'
    },
    22: {
        'название': 'Сила Крови',
        "тема": 'Тем, кто в сражении',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAAM_ZjQCtjfeK9qGAgpVZq0luV40OksAAsIBMhtLJqFJai6EdRO86M0BAAMCAAN5AAM0BA',
        'автор': 'Боб Сордж'
    },
    23: {
        'название': 'Движимые вечностью',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAAM9ZjQCtK-cDKiIzXaQ3IsbO6s6ufIAAsEBMhtLJqFJI9UjmVgG8ngBAAMCAAN5AAM0BA',
        'автор': 'Джон Бивер'
    },
    24: {
        'название': 'Разрывающий оковы',
        "тема": 'Тем, кто в сражении',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAAM7ZjQCseN0olwUvxUbmxgGBqkDuLUAAsABMhtLJqFJsnydJIQ5h4wBAAMCAAN5AAM0BA',
        'автор': 'Нил Андерсон'
    },
    25: {
        'название': 'Христианская Вера',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAAM5ZjQCr8BZ-ICWhA8dMoa9zXOH7QcAAr8BMhtLJqFJcvO5_bX0LiUBAAMCAAN5AAM0BA',
        'автор': 'Уэйн Грудем'
    },
    26: {
        'название': 'Добро или Бог?',
        "тема": 'История - Учение',
        "рецензии": "",
        'картинка': 'AgACAgIAAxkBAAM3ZjQCrBD1mbmCwiuwzd2S8Ji-yU4AAr4BMhtLJqFJjcuiR3xPXe0BAAMCAAN5AAM0BA',
        'автор': 'Джон Бивер'
    },



}

ministry_dict = {

    'Прославление':
    {
            'картинка': 'AgACAgIAAxkBAAMiZjQAAbCE7NjnA5EAASMSdrI5recB4wAC3eAxG-4NoEnRragWPbUqHAEAAwIAA3gAAzQE',
            'контакт': 'https://t.me/antpiunovz',
            'текст': '''Если ты…

▫️знаешь всё прославление наизусть, 
▫️поёшь, 
▫️играешь на музыкальных инструментах, 
▫️готов работать в команде

или просто-напросто любишь  музыку и готов учиться чему-то новому…

То, знакомься: команда молодёжного прославления и её лидер — Антон Пиунов! 🎸

Не стесняйся, 
Антон не кусается — 
на все вопросы ответит, 
микрофон/гитару/etc вручит 
и, конечно, прослушает! 

‼️особенно сильно прославление нуждается в бас- и электрогитаристах;) 

Пиши @antpiunovz и до встречи на сцене! 🤩'''
    },

    'Медиа-служение':
    {
        'картинка': 'AgACAgIAAxkBAAMoZjQAAbg82l00JI5eljWyVUQcpZvFAALi4DEb7g2gSVDzQiU5qHmEAQADAgADeAADNAQ',
        'контакт': 'https://t.me/+79826671593',
        'текст': '''Если ты…

готов учиться чему-то новому, 
ответственный, верный и креативный…

то тебе к Дарье Костиной — лидеру медиа-служения! 💚

которое, надо сказать, немаленькое: 

🔴фото и видео
🔴дизайн и монтаж
🔴тексты и ведение соцсетей

не умеешь — не страшно: 
всему научим, 
со всем поможем 💯

пиши Дарье (https://t.me/+79826671593) — и ты в команде! 

#хочуслужить 
#служение'''
    },

    'Молодежное служение': {
        'картинка': 'AgACAgIAAxkBAAMgZjQAAa1VhjHKqrpRDBBzx7MkgMopAALf4DEb7g2gSVra1XqN_mTuAQADAgADeAADNAQ',
        'контакт': 'https://t.me/apolosagdiev',
        'текст': '''Если ты...
хочешь служить Богу, 
но
не определился/не знаешь, 
как и где можешь пригодиться… 

то тебе к Паше Сагдиеву — лидеру молодёжного служения Rhema! 🫡

100% поможет, 
100% пристроит, гарантируем! 

Короче, 
пиши @apolosagdiev 
и вперёд в служение! 💪

#хочуслужить 
#служение'''
    },

    'Молодежный альфа-курс': {
        'картинка': 'AgACAgIAAxkBAAMeZjQAAaEW1UYNMQHttkqs_hYx_OIyAALg4DEb7g2gSc-oQysRTjB8AQADAgADeAADNAQ',
        'контакт': 'https://t.me/SashSape',
        'текст': '''Если ты… 

🔴верный и ответственный человек,
🔴легко находишь общий язык с молодежью,
🔴любишь знакомиться и говорить о Боге…

Молодёжная Альфа ждёт тебя! 🚨
Её лидер — Александр Сапегин, 
он подробно ответит на твои вопросы 

Не медли, 
пиши @SashSape и вперёд служить!

#хочуслужить 
#служение'''
    },

    'Ячеечное служение': {
        'картинка': 'AgACAgIAAxkBAAMmZjQAAbWeKT_MPqSzCSu64yw1HD5tAALh4DEb7g2gSQirK9Upyr-ZAQADAgADeAADNAQ',
        'контакт': 'https://t.me/mosdandi',
        'текст': '''Если ты...

🖇️Ты любишь общаться и умеешь делать это?

🖇️Этим умением ты можешь служить людям! 

Знакомься, ячеечное служение и его лидер — 
Даня Мостицкий! 

Всему научит, всё покажет, одного не оставит 🤝🏻
К нему же по всем вопросам;)

Еще раздумываешь?! 
Бегом к @mosdandi.

У тебя всё получится!

#хочуслужить 
#служение'''
    },

    'Служба порядка': {
        'картинка': 'AgACAgIAAxkBAAMkZjQAAbMnMELTwxrnQpjoGr8pN6KMAALc4DEb7g2gSazmxw_C-iqRAQADAgADeQADNAQ',
        'контакт': 'https://t.me/+79221385012',
        'текст': """Если ты...
Хочешь стать 
частью службы порядка, 
то, знакомься, её лидер — 
Иван Ватолин! 
По всем вопросам, просьбам, предложениям — к нему 🤝🏻

Сейчас служба порядка нуждается в верных служителях особенно сильно.
Служба порядка нуждается в тебе!

Не медли:
Номер Вани: +7 922 138 5012

#хочуслужить 
#служение"""
    },
'Администривное служение':
    {
            'картинка': 'AgACAgIAAxkBAAIEOGY7tHsHY9APVVCbGBiho2PndYm_AALW3jEbGzHgSdj4i-JPYyqAAQADAgADeQADNQQ',
            'контакт': 'https://t.me/shaur_ma',
            'текст': '''Если ты…
человек с чувством юмора и высоким уровнем самоорганизации,
легко отыскиваешь подход к людям
и не боишься ответственности…
Добро пожаловать!
Лидер административного служения Rhema — Ирина Мостицкая с нетерпением ждёт тебя!
Есть вопросы — не стесняйся, пиши ей
Once again — всему научат, со всем помогут, одного не оставят!
Пиши @shaur_ma и вперееед в служение!'''

},
'Библиотека':
    {
            'картинка': 'AgACAgIAAxkBAAIEOmY7tIPBdCm4wb-L6jnzRNegLRxVAALT3jEbGzHgSUQzAAEUB2w5BwEAAwIAA3gAAzUE',
            'контакт': 'https://t.me/EkkPod',
            'текст': '''Если ты…
верный, ответственный человек,
любишь порядок, кофе
и расширять кругозор
то именно тебя мы и ждали!
 
Библиотекарь молодежного служения Rhema — Екатерина Подкорытова с радостью примет тебя в команду!
Как и всегда: выслушают, помогут, научат, как пройти в библиотеку подскажут!
Остались вопросы?
Не стесняйся, пиши @EkkPod!
И до встречи в библиотеке!'''

}
}